src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКлючаСессииМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПараметраКлючаСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП/Forms/ФормаТокенаАвторизации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступноИзменениеТокена = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДанныеКлючаСессииМДЛП);
	
	Элементы.Токен.ТолькоПросмотр       = Не ДоступноИзменениеТокена;
	Элементы.ДействуетДо.ТолькоПросмотр = Элементы.ДействуетДо.ТолькоПросмотр Или Не ДоступноИзменениеТокена;
	Если ДоступноИзменениеТокена Тогда
		ЗаголовокКоманды = НСтр("ru = 'Записать и закрыть'");
	Иначе
		ЗаголовокКоманды = НСтр("ru = 'Закрыть'");
	КонецЕсли;
	Элементы.ФормаЗакрытьФорму.Заголовок = ЗаголовокКоманды;
	
	ТипТокенаАвторизации   = Параметры.ТипТокенаАвторизации;
	Организация            = Параметры.Организация;
	
	Если ЗначениеЗаполнено(ТипТокенаАвторизации) Тогда
		ПолучитьТокен();
	КонецЕсли;
	
	Элементы.ТипТокенаАвторизации.ТолькоПросмотр   = Не Параметры.СозданиеТокена;
	Элементы.Организация.ТолькоПросмотр            = Не Параметры.СозданиеТокена;
	
	Если Параметры.СозданиеТокена Тогда
		Организация = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Модифицированность = Не ЗначениеЗаполнено(Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Если Модифицированность Тогда
		Если Не ПроверитьЗаполнениеДанных() Тогда
			Возврат;
		КонецЕсли;
		ЗаписатьТокен();
		ПараметрЗакрытия = Истина;
	Иначе
		ПараметрЗакрытия = Неопределено;
	КонецЕсли;
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТокен()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеКлючаСессии = РегистрыСведений.ДанныеКлючаСессииМДЛП.ПолучитьСохраненныеДанныеКлючаСессии(РазрешительныйРежимМДЛПКлиентСервер.ИмяДанныхКлючаСессии(ТипТокенаАвторизации));
	Если ДанныеКлючаСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ДанныеКлючаСессии[Организация];
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Токен = Данные.КлючСессии;
	ДействуетДо = МестноеВремя(Данные.ДействуетДо, ЧасовойПоясСеанса());
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеДанных()
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ТипТокенаАвторизации) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Тип токена"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТипТокенаАвторизации", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Организация", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Токен"" не заполнено'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Токен", , Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаписатьТокен()
	
	ТокенДействуетДо = РазрешительныйРежимМДЛПКлиентСервер.ДатаДействияТокенаГИСМТРозница();
	
	ПараметрыКлючаСессии = РазрешительныйРежимМДЛП.ПараметрыКлючаСессии();
	ПараметрыКлючаСессии.КлючСессии  = Токен;
	ПараметрыКлючаСессии.ДействуетДо = ТокенДействуетДо;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИмяПараметраКлючаСессии", РазрешительныйРежимМДЛПКлиентСервер.ИмяДанныхКлючаСессии(ТипТокенаАвторизации));
	ПараметрыЗапроса.Вставить("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.ДанныеКлючаСессииМДЛП.УстановитьКлючСессии(ПараметрыЗапроса, ПараметрыКлючаСессии);
	
КонецПроцедуры

#КонецОбласти
